## Dataframes Read & Write in different File Formats(CSV, JSON, HTML, Excel, Pickle)
* Convert Dataframes to different Fileformats
* Read differert Fileformats and save in Dataframes

In [1]:
import pandas as pd
import numpy as np

In [2]:
from io import StringIO, BytesIO

####  1. CSV File

In [3]:
# Data in String format separated by Comma
data1 = ('col1,col2,col3\n'
           'x,y,1\n'
           'a,b,2\n' 
           'c,d,3\n')
print(data1)
print(type(data1))
df1 = pd.read_csv(StringIO(data1))  # Convert String to DataFrame
df1

col1,col2,col3
x,y,1
a,b,2
c,d,3

<class 'str'>

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [4]:
df2 = pd.read_csv(StringIO(data1), usecols=['col1', 'col3'])  # Display Particular Columns
df2

  col1  col3
0    x     1
1    a     2
2    c     3

In [5]:
data2 = ('col1,col2,col3,col4\n'
           'x,1,2,12\n'
           'a,3,4.2,14\n' 
           'c,4,,16\n')
print(data2)
df3 = pd.read_csv(StringIO(data2), dtype=object)  # Convert String to DataFrame
df3

col1,col2,col3,col4
x,1,2,12
a,3,4.2,14
c,4,,16

  col1 col2 col3 col4
0    x    1    2   12
1    a    3  4.2   14
2    c    4  NaN   16

In [6]:
# df4 = pd.read_csv(StringIO(data2), dtype=int)  # Not possible--> NaN
# df4

In [7]:
df5 = pd.read_csv(StringIO(data2),dtype={'col2':'Int64', 'col3':object, 'col4':float}) # Assign Column datatypes
df5

  col1  col2 col3  col4
0    x     1    2  12.0
1    a     3  4.2  14.0
2    c     4  NaN  16.0

In [8]:
df5.dtypes # Display Datatypes of all Columns

col1     object
col2      Int64
col3     object
col4    float64
dtype: object

In [9]:
print(df5['col1'][2])
print(df5['col2'][2])

c
4

In [10]:
print(type(df5['col1'][2]))
print(type(df5['col2'][2]))

<class 'str'>
<class 'numpy.int64'>

In [11]:
df6 = pd.read_csv(StringIO(data2),index_col=0)
df6

      col2  col3  col4
col1
x        1   2.0    12
a        3   4.2    14
c        4   NaN    16

In [12]:
# After cow, 
data3 = ('a,b,c \n'
        '4,apple,cow,\n'
        '6,banana,tiger')

In [13]:
df7 = pd.read_csv(StringIO(data3))  # Index Column is Wrong. Need to Overcome, Make index_col as False
df7

        a      b  c
4   apple    cow NaN
6  banana  tiger NaN

In [14]:
df8 = pd.read_csv(StringIO(data3),index_col=False)
df8

   a       b     c
0  4   apple    cow
1  6  banana  tiger

#### Created DataFrame

In [15]:
df9 = pd.DataFrame(np.arange(1,41,2).reshape(4,5),index=['R0','R1','R2','R3'], columns = ['C0','C1','C2','C3','C4'])
df9

    C0  C1  C2  C3  C4
R0   1   3   5   7   9
R1  11  13  15  17  19
R2  21  23  25  27  29
R3  31  33  35  37  39

In [16]:
df9.to_csv("arrDataCSV.csv")     # Convert dataframe into .csv file

In [17]:
df9.to_csv('F:/DataScience/Python Practice/path/arrDataCSV.csv')  # Path: /// forward Slash ///

In [18]:
df10 = pd.read_csv("F:/DataScience/Python Practice/path/arrDataCSV.csv")   # Read CSV file
df10

  Unnamed: 0  C0  C1  C2  C3  C4
0         R0   1   3   5   7   9
1         R1  11  13  15  17  19
2         R2  21  23  25  27  29
3         R3  31  33  35  37  39

In [19]:
df11 = pd.read_csv("F:/DataScience/Python Practice/path/arrDataSemicolon.csv",sep=';')  # If seperated by ; (Not ,)
df11

  Unnamed: 0  C0  C1  C2  C3  C4
0         R0   1   3   5   7   9
1         R1  11  13  15  17  19
2         R2  21  23  25  27  29
3         R3  31  33  35  37  39

In [20]:
## Quoting and Escape Characters. Useful in NLP
textData = 'a,b\n"Hello, \\ Bob, \\Nice to See U",5'

In [21]:
df12 = pd.read_csv(StringIO(textData), escapechar='\\')
df12

                            a  b
0  Hello,  Bob, Nice to See U  5

In [22]:
## URL to CSV
## seperating by TAB space
df13 = pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item',sep='\t')
df13.head()

,item_code,item_name,display_level,selectable,sort_sequence
0,AA0,All items - old base,0,T,2
1,AA0R,Purchasing power of the consumer dollar - old ...,0,T,399
2,SA0,All items,0,T,1
3,SA0E,Energy,1,T,374
4,SA0L1,All items less food,1,T,358

#### 2. Json File

In [23]:
jData= '{"employeeName": "JKPradeep","email": "jkpradeep93@gmail.com","education": [{"SSC" : "89%","inter":"90%"}]}' # Nested Data
#jData1= '{"employeeName": "JKPradeep","email": "899","education": "90"}' # Not working??
### ValueError: If using all scalar values, you must pass an index
jData1= '{"0":{"employeeName": "JKPradeep","email": "899","education": "90"}}' # Working
jData2='{"employees":[{"firstName":"John","lastName":"Doe"},{"firstName":"Anna","lastName":"Smith"},{"firstName":"Peter","lastName":"Jones" }]}'

In [24]:
print(type(jData))
print(type(jData1))
print(type(jData2))

<class 'str'>
<class 'str'>
<class 'str'>

In [25]:
jData

'{"employeeName": "JKPradeep","email": "jkpradeep93@gmail.com","education": [{"SSC" : "89%","inter":"90%"}]}'

In [26]:
jData1

'{"0":{"employeeName": "JKPradeep","email": "899","education": "90"}}'

In [27]:
jData2

'{"employees":[{"firstName":"John","lastName":"Doe"},{"firstName":"Anna","lastName":"Smith"},{"firstName":"Peter","lastName":"Jones" }]}'

In [28]:
df14 = pd.read_json(jData)
df14_1 = pd.read_json(jData1)
df14_2 = pd.read_json(jData2)

In [29]:
df14

  employeeName                  email                       education
0    JKPradeep  jkpradeep93@gmail.com  {'SSC': '89%', 'inter': '90%'}

In [30]:
df14_1

                      0
education            90
email               899
employeeName  JKPradeep

In [31]:
df14_2

                                     employees
0     {'firstName': 'John', 'lastName': 'Doe'}
1   {'firstName': 'Anna', 'lastName': 'Smith'}
2  {'firstName': 'Peter', 'lastName': 'Jones'}

In [32]:
df14_2.to_json("W3SchoolsJsonData.json")

In [33]:
# Convert Dataframe into Json format
df14.to_json()

'{"employeeName":{"0":"JKPradeep"},"email":{"0":"jkpradeep93@gmail.com"},"education":{"0":{"SSC":"89%","inter":"90%"}}}'

In [34]:
df14.to_json("EmployeeJsonData.json")

In [35]:
df14.to_json(orient="index")

'{"0":{"employeeName":"JKPradeep","email":"jkpradeep93@gmail.com","education":{"SSC":"89%","inter":"90%"}}}'

In [36]:
df14.to_json(orient="records")

'[{"employeeName":"JKPradeep","email":"jkpradeep93@gmail.com","education":{"SSC":"89%","inter":"90%"}}]'

In [37]:
df14.to_json(orient="split")

'{"columns":["employeeName","email","education"],"index":[0],"data":[["JKPradeep","jkpradeep93@gmail.com",{"SSC":"89%","inter":"90%"}]]}'

In [38]:
## Data is Reading Directly from URL ##Not necessary to Download  ## If it is NestedData --> Need to Do Custom Parsing
df15 = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data",header=None)
df15.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

#### 3. Reading HTML Content
- Reading Table from HTML page
- Simply called WebScraping

In [39]:
url = 'https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/banklist.html'

df16 = pd.read_html(url) ## All HTML Tables in that page - information is grasped

In [40]:
df16               # Incomplete Data

[                             Bank Name           City  ST   CERT  \
 0                 The First State Bank  Barboursville  WV  14361
 1                   Ericson State Bank        Ericson  NE  18265
 2     City National Bank of New Jersey         Newark  NJ  21111
 3                        Resolute Bank         Maumee  OH  58317
 4                Louisa Community Bank         Louisa  KY  58112
 ..                                 ...            ...  ..    ...
 556                 Superior Bank, FSB       Hinsdale  IL  32646
 557                Malta National Bank          Malta  OH   6629
 558    First Alliance Bank & Trust Co.     Manchester  NH  34264
 559  National State Bank of Metropolis     Metropolis  IL   3815
 560                   Bank of Honolulu       Honolulu  HI  21029

                    Acquiring Institution       Closing Date
 0                         MVB Bank, Inc.      April 3, 2020
 1             Farmers and Merchants Bank  February 14, 2020
 2                        Industrial Bank   November 1, 2019
 3                     Buckeye State Bank   October 25, 2019
 4      Kentucky Farmers Bank Corporation   October 25, 2019
 ..                                   ...                ...
 556                Superior Federal, FSB      July 27, 2001
 557                    North Valley Bank        May 3, 2001
 558  Southern New Hampshire Bank & Trust   February 2, 2001
 559              Banterra Bank of Marion  December 14, 2000
 560                   Bank of the Orient   October 13, 2000

 [561 rows x 6 columns]]

In [41]:
df16[0]   # 1st table in that HTML page

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
...,...,...,...,...,...,...
556,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
557,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
558,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
559,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
560,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [42]:
type(df16)

list

In [43]:
# Wikipedia - Many Tables in that HTML page
url_mcc = 'https://en.wikipedia.org/wiki/Mobile_country_code'
df17 = pd.read_html('https://en.wikipedia.org/wiki/Mobile_country_code')

In [44]:
df17[0]   # 1st Table in that HTML page

,MCC,MNC,Brand,Operator,Status,Bands (MHz),References and notes
0,1,1,TEST,Test network,Operational,any,NaN
1,1,1,TEST,Test network,Operational,any,NaN
2,999,99,NaN,Internal use,Operational,any,"Internal use in private networks, no roaming[4]"
3,999,999,NaN,Internal use,Operational,any,"Internal use in private networks, no roaming[4]"

In [45]:
df17[1]   # 2nd Table in that HTML page

,Mobile country code,Country,ISO 3166,Mobile network codes,National MNC authority,Remarks
0,289,A Abkhazia,GE-AB,List of mobile network codes in Abkhazia,NaN,MCC is not listed by ITU
1,412,Afghanistan,AF,List of mobile network codes in Afghanistan,NaN,NaN
2,276,Albania,AL,List of mobile network codes in Albania,NaN,NaN
3,603,Algeria,DZ,List of mobile network codes in Algeria,NaN,NaN
4,544,American Samoa (United States of America),AS,List of mobile network codes in American Samoa,NaN,NaN
...,...,...,...,...,...,...
247,452,Vietnam,VN,List of mobile network codes in the Vietnam,NaN,NaN
248,543,W Wallis and Futuna,WF,List of mobile network codes in Wallis and Futuna,NaN,NaN
249,421,Y Yemen,YE,List of mobile network codes in the Yemen,NaN,NaN
250,645,Z Zambia,ZM,List of mobile network codes in Zambia,NaN,NaN
251,648,Zimbabwe,ZW,List of mobile network codes in Zimbabwe,NaN,NaN

In [46]:
df17 = pd.read_html(url_mcc, match="Country",header=0)
df17

[     Mobile country code                                    Country ISO 3166  \
 0                    289                                 A Abkhazia    GE-AB
 1                    412                                Afghanistan       AF
 2                    276                                    Albania       AL
 3                    603                                    Algeria       DZ
 4                    544  American Samoa (United States of America)       AS
 ..                   ...                                        ...      ...
 247                  452                                    Vietnam       VN
 248                  543                        W Wallis and Futuna       WF
 249                  421                                    Y Yemen       YE
 250                  645                                   Z Zambia       ZM
 251                  648                                   Zimbabwe       ZW

                                   Mobile network codes National MNC authority  \
 0             List of mobile network codes in Abkhazia                    NaN
 1          List of mobile network codes in Afghanistan                    NaN
 2              List of mobile network codes in Albania                    NaN
 3              List of mobile network codes in Algeria                    NaN
 4       List of mobile network codes in American Samoa                    NaN
 ..                                                 ...                    ...
 247        List of mobile network codes in the Vietnam                    NaN
 248  List of mobile network codes in Wallis and Futuna                    NaN
 249          List of mobile network codes in the Yemen                    NaN
 250             List of mobile network codes in Zambia                    NaN
 251           List of mobile network codes in Zimbabwe                    NaN

                       Remarks
 0    MCC is not listed by ITU
 1                         NaN
 2                         NaN
 3                         NaN
 4                         NaN
 ..                        ...
 247                       NaN
 248                       NaN
 249                       NaN
 250                       NaN
 251                       NaN

 [252 rows x 6 columns]]

In [47]:
df17[0]

,Mobile country code,Country,ISO 3166,Mobile network codes,National MNC authority,Remarks
0,289,A Abkhazia,GE-AB,List of mobile network codes in Abkhazia,NaN,MCC is not listed by ITU
1,412,Afghanistan,AF,List of mobile network codes in Afghanistan,NaN,NaN
2,276,Albania,AL,List of mobile network codes in Albania,NaN,NaN
3,603,Algeria,DZ,List of mobile network codes in Algeria,NaN,NaN
4,544,American Samoa (United States of America),AS,List of mobile network codes in American Samoa,NaN,NaN
...,...,...,...,...,...,...
247,452,Vietnam,VN,List of mobile network codes in the Vietnam,NaN,NaN
248,543,W Wallis and Futuna,WF,List of mobile network codes in Wallis and Futuna,NaN,NaN
249,421,Y Yemen,YE,List of mobile network codes in the Yemen,NaN,NaN
250,645,Z Zambia,ZM,List of mobile network codes in Zambia,NaN,NaN
251,648,Zimbabwe,ZW,List of mobile network codes in Zimbabwe,NaN,NaN

#### 4. Excel File

In [48]:
df1

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [49]:
df1.to_excel("arrDataExcel.xls")    # Convert dataframe into .xls - Excel file

In [50]:
df18 = pd.read_excel('arrDataExcel.xls')
df18

   Unnamed: 0 col1 col2  col3
0           0    x    y     1
1           1    a    b     2
2           2    c    d     3

#### 5. Pickling
- All pandas objects are equipped with to_pickle methods which use Pythons cPickle module to save data structures to disk using the pickle format.
- All formats like excel, csv.... are converted and saved in pickle format. => Easy to retrieve
- Every Machine Learning Algorithm converted to Pickle and deployed in Cloud Servers

In [51]:
# Convert Dataframe into Pickle Format
df18.to_pickle('DataframeInPickle')

In [52]:
df19 = pd.read_pickle('DataframeInPickle')
df19

   Unnamed: 0 col1 col2  col3
0           0    x    y     1
1           1    a    b     2
2           2    c    d     3